app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT * FROM "drivers"

  def show
    @driver = Driver.find(params[:id])
---
SELECT * FROM "drivers" WHERE ("drivers"."id" = 1)

  def create
    @driver = Driver.new(params[:driver])

    respond_to do |format|
      if @driver.save
---
INSERT INTO "drivers" ("address", "created_at", "updated_at", "lastname", "isactive", "firstname", "phone", "lastclockin") VALUES('1111 W Drivingham Way', '2010-04-17 19:56:04', '2010-04-17 19:56:04', 'Driver', 't', 'Test', '317 496-8472', '2010-04-17 19:55:00')