app/controllers/menu_items_controller.rb

  def index
    @menu_items = MenuItem.all
---
SELECT * FROM "menu_items"

  def show
    @menu_item = MenuItem.find(params[:id])
---
SELECT * FROM "menu_items" WHERE ("menu_items"."id" = 1)

  def edit
    @menu_item = MenuItem.find(params[:id])
---
SELECT * FROM "menu_items" WHERE ("menu_items"."id" = 2)

  def create
    @menu_item = MenuItem.new(params[:menu_item])

    respond_to do |format|
      if @menu_item.save
---
INSERT INTO "menu_items" ("name", "restaurant", "price", "created_at", "updated_at", "preptime", "description") VALUES('Noodles', 'ThaiRestaurant', '10', '2010-04-18 01:42:31', '2010-04-18 01:42:31', 10, 'Good')

  def update
    @menu_item = MenuItem.find(params[:id])

    respond_to do |format|
      if @menu_item.update_attributes(params[:menu_item])
---
SELECT * FROM "menu_items" WHERE ("menu_items"."id" = 2)
UPDATE "menu_items" SET "updated_at" = '2010-04-18 05:54:43', "price" = '10.00' WHERE "id" = 2

  def destroy
    @menu_item = MenuItem.find(params[:id])
    @menu_item.destroy
---
SELECT * FROM "menu_items" WHERE ("menu_items"."id" = 1)
DELETE FROM "menu_items" WHERE "id" = 1