app/controllers/menu_controller.rb

SELECT * FROM "menu_items"
---
  def index
    @restaurant_name = params[:id].to_s

	params.each do |key,value|
	  @restaurant_name = value.to_s if key.to_s == "restaurant"
	end

	@items = MenuItem.all.select{ |item| item.restaurant == @restaurant_name }

SELECT * FROM "menu_items"
---
  def update
	restaurant_name = params[:restaurant].to_s
	item_name = params[:item].to_s.strip
	item_count = params[:count].to_i

    puts "update()"
	puts "Name: #{restaurant_name}"
	puts "Item: #{item_name}"
	puts "Count: #{item_count}"

	MenuItem.all.each do |item|