app/controllers/search_controller.rb

  def index
	@search_term = ""
	@search_zip = ""

	# Get search terms from parameters
	params.each do |key, value|
	  @search_term = value.to_s if key.to_s == "searchValue"
	  @search_zip = value.to_s if key.to_s == "zipValue"
	end

	search_terms = @search_term.split

	# Select restaurant list
	@restaurants

	# Just search term, no zip
	if !@search_term.empty? and @search_zip.empty?
	  @restaurants = Restaurant.all.select{ |restaurant| doesRestaurantContainSearch( restaurant, search_terms ) == :true }
---
SELECT * FROM "restaurants"